Tekla Open API Reference for Tekla Structures 2025
Point Methods
The Point type exposes the following members.
Methods
Name | Description
AreEqual
 Compares two points and tells whether they are equal.
CompareTo
 Compares two points. To use binarysearch somekind of sorting should be used.
Equals
 Returns true if the current object and the given object are equal.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns a hash code for the point. Notice, in extremely rare cases, you might not get the same hash code for two points even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Overrides Object.GetHashCode().)
ToString
 Formats the point into a string.
 (Overrides Object.ToString().)
Translate
 Translates the point using the given vector.
Zero
 Zeros all the members of the point.
Top
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace